doc: Revision of the generated doc
